#### Terraform Plan 
```
module.iam.data.aws_caller_identity.current: Reading...
module.ses.aws_ses_email_identity.sender: Refreshing state... [id=noreply@otmuse.ai]
module.dynamodb.aws_dynamodb_table.auth: Refreshing state... [id=ot-muse-users]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=539272219375]
module.iam.aws_iam_role.amplify_ssr: Refreshing state... [id=ot-muse-amplify-ssr]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.iam.aws_iam_role.amplify_ssr has been deleted
  - resource "aws_iam_role" "amplify_ssr" {
      - arn                   = "arn:aws:iam::539272219375:role/ot-muse-amplify-ssr" -> null
        id                    = "ot-muse-amplify-ssr"
      - name                  = "ot-muse-amplify-ssr" -> null
        tags                  = {
            "Component" = "auth"
        }
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.iam.aws_iam_policy.amplify_ssr will be created
  + resource "aws_iam_policy" "amplify_ssr" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Scoped access to DynamoDB and SES for OT-Muse Amplify SSR"
      + id               = (known after apply)
      + name             = "ot-muse-amplify-ssr-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:UpdateItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:Query",
                          + "dynamodb:BatchWriteItem",
                          + "dynamodb:BatchGetItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-1:539272219375:table/ot-muse-users",
                          + "arn:aws:dynamodb:us-east-1:539272219375:table/ot-muse-users/index/*",
                        ]
                      + Sid      = "DynamoDBAccess"
                    },
                  + {
                      + Action    = [
                          + "ses:SendEmail",
                          + "ses:SendRawEmail",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "ses:FromAddress" = "noreply@otmuse.ai"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "SESAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Component" = "auth"
        }
      + tags_all         = {
          + "Component"   = "auth"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ot-muse"
        }
    }

  # module.iam.aws_iam_role.amplify_ssr will be created
  + resource "aws_iam_role" "amplify_ssr" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SourceAccount" = "539272219375"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "amplify.amazonaws.com"
                        }
                      + Sid       = "AllowAmplifyAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ot-muse-amplify-ssr"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component" = "auth"
        }
      + tags_all              = {
          + "Component"   = "auth"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ot-muse"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.iam.aws_iam_role_policy_attachment.amplify_ssr will be created
  + resource "aws_iam_role_policy_attachment" "amplify_ssr" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ot-muse-amplify-ssr"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + amplify_ssr_role_arn  = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

*Pushed by: @OnTrak-Tech*